# CurtainWallSyspanelThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurtainWallSyspanelThickness Property
ParameterTypeId Class See Also
---
"Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurtainWallSyspanelThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurtainWallSyspanelThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurtainWallSyspanelThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace